design-pattern/src/main/java/dp_Adaptor/Adaptor1.puml
@startuml

class Client{
}
class Target {
	+ targetMethod1 : ??
	+ targetMethod2 : ??
}
class Adaptor{
	- adaptee: Adaptee

	+ targetMethod1() : ??
	+ targetMethod2() : ??
}
class Adaptee{
	+ methodA() : ??
	+ methodB() : ??
	+ methodC() : ??
}

Client --> Target : uses
Target <|- Adaptor : extends
Adaptor o-> Adaptee : has

@enduml
