design-pattern/src/main/java/dp_Adaptor/README.md
```mermaid
classDiagram
    class Target {
        +targetMethod1(): ??
        +targetMethod2(): ??
    }
    class Adapter {
        +adaptee: Adaptee
        +targetMethod1(): ??
        +targetMethod2(): ??
    }
    class Adaptee {
        +methodA():??
        +methodB():??
        +methodC():??
    }
    Client --> Target: uses
    Target <|-- Adapter: extends
    Adapter o--> Adaptee: has
```
